# 문제
# 정수 4를 1, 2, 3의 합으로 나타내는 방법은 총 7가지가 있다. 합을 나타낼 때는 수를 1개 이상 사용해야 한다.
#
# 1+1+1+1
# 1+1+2
# 1+2+1
# 2+1+1
# 2+2
# 1+3
# 3+1
# 정수 n이 주어졌을 때, n을 1, 2, 3의 합으로 나타내는 방법의 수를 구하는 프로그램을 작성하시오.
#
# 입력
# 첫째 줄에 테스트 케이스의 개수 T가 주어진다. 각 테스트 케이스는 한 줄로 이루어져 있고, 정수 n이 주어진다. n은 양수이며 1,000,000보다 작거나 같다.
#
# 출력
# 각 테스트 케이스마다, n을 1, 2, 3의 합으로 나타내는 방법의 수를 1,000,000,009로 나눈 나머지를 출력한다.

mod = 1000000009
limit = 1000001
t = int(input())
n = []
for _ in range(t):
    n.append(int(input()))

#d[n]: 정수 n이 주어졌을 때 1,2,3의 합으로 나타내는 방법의 수
#d[n] = d[n-1] + d[n-2] + d[n-3]
d = [0]*limit
d[1] = 1
d[2] = 2
d[3] = 4
for k in range(4,limit):
    d[k] = d[k-1] + d[k-2] + d[k-3]
    d[k] %= mod

for i in n:
    print(d[i]%mod)

print(d[:10])
